Ontaelio/STM32F103-Ublink-framework/stm32f103_timers.h
	virtual void IRQenable() =0;
	virtual void IRQdisable() =0;

	virtual void priority(uint8_t pri) =0;

	virtual void writeCC1(uint16_t val) =0;
	virtual void writeCC2(uint16_t val) =0;
	virtual void writeCC3(uint16_t val) =0;
	virtual void writeCC4(uint16_t val) =0;

	virtual void CC1output(uint8_t bit) =0;
	virtual void CC2output(uint8_t bit) =0;
	virtual void CC3output(uint8_t bit) =0;
	virtual void CC4output(uint8_t bit) =0;

	//BB (atomic) stuff
	//update event enable/disable (CR1->UDIS)
	virtual void updateDisable() =0;
	virtual void updateEnable() =0;

	//fast interrupt enable/disable (1 or 0)
	virtual void updateInterrupt(uint8_t bit) =0;
	virtual void CC1interrupt(uint8_t bit) =0;
	virtual void CC2interrupt(uint8_t bit) =0;
	virtual void CC3interrupt(uint8_t bit) =0;
	virtual void CC4interrupt(uint8_t bit) =0;
	virtual void triggerInterrupt(uint8_t bit) =0;

	//check status flags
	virtual uint8_t checkUpdate() =0;
	virtual uint8_t checkCC1() =0;
	virtual uint8_t checkCC2() =0;
	virtual uint8_t checkCC3() =0;
	virtual uint8_t checkCC4() =0;
	virtual uint8_t checkTrigger() =0;

	//event generators
	virtual void updateEvent() =0;
	virtual void CC1event() =0;
	virtual void CC2event() =0;
	virtual void CC3event() =0;
	virtual void CC4event() =0;
	virtual void triggerEvent() =0;

	//interrupt flag cleaners, should use BB for these most certainly
	virtual void clearUpdate() =0;
	virtual void clearCC1() =0;
	virtual void clearCC2() =0;
	virtual void clearCC3() =0;
	virtual void clearCC4() =0;
	virtual void clearTrigger() =0;
	virtual void clearAll() =0;

	//DMA stuff
	virtual void DMATRGenable() =0;
	virtual void DMACCenable(uint8_t ch_num) =0;
	virtual void DMAUPenable() =0;
	virtual void DMATRGdisable() =0;
	virtual void DMACCdisable(uint8_t ch_num) =0;
	virtual void DMAUPdisable() =0;
	virtual void DMAburst(uint8_t burst) =0;
	virtual void DMAbase(uint8_t base) =0;


};

// inherited classes

class tim1_pwm : public tim_pwm
{
public:
//	tim1_pwm(uint8_t ch_num): pwmMode(1), centerMode(0), direction(0), polarity(0), prescaler(0),
//							  depth(0xFFFF), channel(ch_num), ch_addr(channel*4 + 0x30){};
	tim1_pwm(uint8_t ch_num, uint16_t d = 0xFFFF): tim_pwm(ch_num, d){}
	tim1_pwm(): tim_pwm(){}
	void init(uint8_t opendrain = 1);
	void enable();
	void disable() {_TIM1_(TIMX_CCER) &= ~(1<<((channel-1)*4));} //output off
	void write(uint16_t pwm_val) {_TIM1_(ch_addr) = pwm_val;}
	void updateEvent() {BB_TIM1_EGR_UG = 1;}
	void CCevent() {_TIM1_(TIMX_EGR) |= 1<<channel;}

	//check status flags
	uint8_t checkUpdate() {return (_TIM1_(TIMX_SR) & TIMX_SR_UIF);}
	uint8_t checkCC() {return ((_TIM1_(TIMX_SR) >> channel) & 1);}
	void clearUpdate() {_TIM1_(TIMX_SR) &= ~TIMX_SR_UIF;}
	void clearCC() {_TIM1_(TIMX_SR) &= ~(1<<channel);}

	void DMAenable() {_TIM1_(TIMX_DIER) |= (1 << (channel+8));}
	void DMAdisable() {_TIM1_(TIMX_DIER) &= ~(1 << (channel+8));}

	operator uint16_t() {return _TIM1_(ch_addr);}
	tim1_pwm& operator= (const uint16_t& a) {write(a); return *this;}
	tim1_pwm& operator++ () {write (_TIM1_(ch_addr) + 1); return *this;}
	tim1_pwm operator++ (int) {write (_TIM1_(ch_addr) + 1); return *this;}
	tim1_pwm& operator-- () {write (_TIM1_(ch_addr) - 1); return *this;}
	tim1_pwm operator-- (int) {write (_TIM1_(ch_addr) - 1); return *this;}
	tim1_pwm& operator+= (const uint16_t& a) {write (_TIM1_(ch_addr) + a); return *this;}
	tim1_pwm& operator-= (const uint16_t& a) {write (_TIM1_(ch_addr) - a); return *this;}
	//uint8_t pwmMode, centerMode, direction, polarity;
	//uint16_t prescaler, depth;

private:
	//uint8_t channel, ch_addr, ccmr, cms_dir, ccer;
};

class tim2_pwm : public tim_pwm
{
public:
//	tim2_pwm(uint8_t ch_num): pwmMode(1), centerMode(0), direction(0), polarity(0), prescaler(0),
//							  depth(0xFFFF), channel(ch_num), ch_addr(channel*4 + 0x30){};
	tim2_pwm(uint8_t ch_num, uint16_t d = 0xFFFF): tim_pwm(ch_num, d){}
	tim2_pwm(): tim_pwm(){}
	void init(uint8_t opendrain = 1);
	void enable();
	void disable() {_TIM2_(TIMX_CCER) &= ~(1<<((channel-1)*4));} //output off
	void write(uint16_t pwm_val) {_TIM2_(ch_addr) = pwm_val;}
	void updateEvent() {BB_TIM2_EGR_UG = 1;}
	void CCevent() {_TIM2_(TIMX_EGR) |= 1<<channel;}

	//check status flags
	uint8_t checkUpdate() {return (_TIM2_(TIMX_SR) & TIMX_SR_UIF);}
	uint8_t checkCC() {return ((_TIM2_(TIMX_SR) >> channel) & 1);}
	void clearUpdate() {_TIM2_(TIMX_SR) &= ~TIMX_SR_UIF;}
	void clearCC() {_TIM2_(TIMX_SR) &= ~(1<<channel);}

	void DMAenable() {_TIM2_(TIMX_DIER) |= (1 << (channel+8));}
	void DMAdisable() {_TIM2_(TIMX_DIER) &= ~(1 << (channel+8));}

	operator uint16_t() {return _TIM2_(ch_addr);}
	tim2_pwm& operator= (const uint16_t& a) {write(a); return *this;}
	tim2_pwm& operator++ () {write (_TIM2_(ch_addr) + 1); return *this;}
	tim2_pwm operator++ (int) {write (_TIM2_(ch_addr) + 1); return *this;}
	tim2_pwm& operator-- () {write (_TIM2_(ch_addr) - 1); return *this;}
	tim2_pwm operator-- (int) {write (_TIM2_(ch_addr) - 1); return *this;}
	tim2_pwm& operator+= (const uint16_t& a) {write (_TIM2_(ch_addr) + a); return *this;}
	tim2_pwm& operator-= (const uint16_t& a) {write (_TIM2_(ch_addr) - a); return *this;}
	//uint8_t pwmMode, centerMode, direction, polarity;
	//uint16_t prescaler, depth;

private:
	//uint8_t channel, ch_addr, ccmr, cms_dir, ccer;
};

class tim3_pwm : public tim_pwm
{
public:
//	tim3_pwm(uint8_t ch_num): pwmMode(1), centerMode(0), direction(0), polarity(0), prescaler(0),
//							  depth(0xFFFF), channel(ch_num), ch_addr(channel*4 + 0x30){};
	tim3_pwm(uint8_t ch_num, uint16_t d = 0xFFFF): tim_pwm(ch_num, d){}
	tim3_pwm(): tim_pwm(){}
	void init(uint8_t opendrain = 1);
	void enable();
	void disable() {_TIM3_(TIMX_CCER) &= ~(1<<((channel-1)*4));} //output off
	void write(uint16_t pwm_val) {_TIM3_(ch_addr) = pwm_val;}
	void updateEvent() {BB_TIM3_EGR_UG = 1;}
	void CCevent() {_TIM3_(TIMX_EGR) |= 1<<channel;}

	//check status flags
	uint8_t checkUpdate() {return (_TIM3_(TIMX_SR) & TIMX_SR_UIF);}
	uint8_t checkCC() {return ((_TIM3_(TIMX_SR) >> channel) & 1);}
	void clearUpdate() {_TIM3_(TIMX_SR) &= ~TIMX_SR_UIF;}
	void clearCC() {_TIM3_(TIMX_SR) &= ~(1<<channel);}

	void DMAenable() {_TIM3_(TIMX_DIER) |= (1 << (channel+8));}
	void DMAdisable() {_TIM3_(TIMX_DIER) &= ~(1 << (channel+8));}

	operator uint16_t() {return _TIM3_(ch_addr);}
	tim3_pwm& operator= (const uint16_t& a) {write(a); return *this;}
	tim3_pwm& operator++ () {write (_TIM3_(ch_addr) + 1); return *this;}
	tim3_pwm operator++ (int) {write (_TIM3_(ch_addr) + 1); return *this;}
	tim3_pwm& operator-- () {write (_TIM3_(ch_addr) - 1); return *this;}
	tim3_pwm operator-- (int) {write (_TIM3_(ch_addr) - 1); return *this;}
	tim3_pwm& operator+= (const uint16_t& a) {write (_TIM3_(ch_addr) + a); return *this;}
	tim3_pwm& operator-= (const uint16_t& a) {write (_TIM3_(ch_addr) - a); return *this;}
	//uint8_t pwmMode, centerMode, direction, polarity;
	//uint16_t prescaler, depth;

