Ontaelio/STM32F103-Ublink-framework/stm32f103_timers.h
private:
	//uint8_t channel, ch_addr, ccmr, cms_dir, ccer;
};

class tim4_pwm : public tim_pwm
{
public:
//	tim4_pwm(uint8_t ch_num): pwmMode(1), centerMode(0), direction(0), polarity(0), prescaler(0),
//							  depth(0xFFFF), channel(ch_num), ch_addr(channel*4 + 0x30){};
	tim4_pwm(uint8_t ch_num, uint16_t d = 0xFFFF): tim_pwm(ch_num, d){}
	tim4_pwm(): tim_pwm(){}
	void init(uint8_t opendrain = 1);
	void enable();
	void disable() {_TIM4_(TIMX_CCER) &= ~(1<<((channel-1)*4));} //output off
	void write(uint16_t pwm_val) {_TIM4_(ch_addr) = pwm_val;}
	void updateEvent() {BB_TIM4_EGR_UG = 1;}
	void CCevent() {_TIM4_(TIMX_EGR) |= 1<<channel;}

	//check status flags
	uint8_t checkUpdate() {return (_TIM4_(TIMX_SR) & TIMX_SR_UIF);}
	uint8_t checkCC() {return ((_TIM4_(TIMX_SR) >> channel) & 1);}
	void clearUpdate() {_TIM4_(TIMX_SR) &= ~TIMX_SR_UIF;}
	void clearCC() {_TIM4_(TIMX_SR) &= ~(1<<channel);}

	void DMAenable() {_TIM4_(TIMX_DIER) |= (1 << (channel+8));}
	void DMAdisable() {_TIM4_(TIMX_DIER) &= ~(1 << (channel+8));}

	operator uint16_t() {return _TIM4_(ch_addr);}
	tim4_pwm& operator= (const uint16_t& a) {write(a); return *this;}
	tim4_pwm& operator++ () {write (_TIM4_(ch_addr) + 1); return *this;}
	tim4_pwm operator++ (int) {write (_TIM4_(ch_addr) + 1); return *this;}
	tim4_pwm& operator-- () {write (_TIM4_(ch_addr) - 1); return *this;}
	tim4_pwm operator-- (int) {write (_TIM4_(ch_addr) - 1); return *this;}
	tim4_pwm& operator+= (const uint16_t& a) {write (_TIM4_(ch_addr) + a); return *this;}
	tim4_pwm& operator-= (const uint16_t& a) {write (_TIM4_(ch_addr) - a); return *this;}
	//uint8_t pwmMode, centerMode, direction, polarity;
	//uint16_t prescaler, depth;

private:
	//uint8_t channel, ch_addr, ccmr, cms_dir, ccer;
};

typedef tim1_pwm tim1_pin;
typedef tim2_pwm tim2_pin;
typedef tim3_pwm tim3_pin;
typedef tim4_pwm tim4_pin;



class timer1: public timer
{
public:
	timer1(uint16_t prsclr = 0x0000, uint16_t depth = 0xFFFF): timer(prsclr, depth), BDTR(TIMX_BDTR_MOE) {}
	uint16_t BDTR;

	void init() {timer1_init();}
	void config();
	void enableOnly() {BB_TIM1_CR1_CEN = 1;}
	void enable(uint16_t count = 0);
	void disable() {BB_TIM1_CR1_CEN = 0;}
	uint16_t read() {return _TIM1_(TIMX_CNT);}
	operator uint16_t() {return _TIM1_(TIMX_CNT);}

	//void master(uint16_t mms, uint16_t ccmr = 0);
	void setSlave(uint16_t sms, uint16_t ts);
	void setMasterOutput(uint16_t moe) {BDTR &= ~TIMX_BDTR_MOE; BDTR |= (moe << 15);}

	//void setCOMIRQ(uint8_t bit=1)		{DIER &= ~0x0020; DIER |= bit<<5;} //tim1 only
	//void setBreakIRQ(uint8_t bit=1)		{DIER &= ~0x0080; DIER |= bit<<7;} //tim1 only

	//void pwmSetup(uint8_t center, uint8_t dir);
	void pwmChannel(uint8_t ch_num, uint8_t mode, uint8_t plrty, uint8_t opendrain = 1);
	void pwmWrite(uint8_t ch_num, uint16_t val) {_TIM1_(ch_num*4 + 0x30) = val;}
	void pwmEnable(uint8_t ch_num);
	void pwmDisable(uint8_t ch_num);

	//for consistency with other timers. Here they enable the update event IRQ
	void IRQenable() {IRQ_0TO31_SER |= IRQ_BITMASK_TIM1_UP;}
	void IRQdisable() {IRQ_0TO31_CER |= IRQ_BITMASK_TIM1_UP;}

	//tim1 only
	void IRQ_BRK_enable() {IRQ_0TO31_SER |= IRQ_BITMASK_TIM1_BRK;}
	void IRQ_UP_enable() {IRQ_0TO31_SER |= IRQ_BITMASK_TIM1_UP;}
	void IRQ_BITMASK_TRG_COM_enable() {IRQ_0TO31_SER |= IRQ_BITMASK_TIM1_TRG_COM;}
	void IRQ_CC_enable() {IRQ_0TO31_SER |= IRQ_BITMASK_TIM1_CC;}
	void IRQ_BRK_disable() {IRQ_0TO31_CER |= IRQ_BITMASK_TIM1_BRK;}
	void IRQ_UP_disable() {IRQ_0TO31_CER |= IRQ_BITMASK_TIM1_UP;}
	void IRQ_BITMASK_TRG_COM_disable() {IRQ_0TO31_CER |= IRQ_BITMASK_TIM1_TRG_COM;}
	void IRQ_CC_disable() {IRQ_0TO31_CER |= IRQ_BITMASK_TIM1_CC;}

	//capture/compare channels
	void writeCC1(uint16_t val) {_TIM1_(TIMX_CCR1) = val;}
	void writeCC2(uint16_t val) {_TIM1_(TIMX_CCR2) = val;}
	void writeCC3(uint16_t val) {_TIM1_(TIMX_CCR3) = val;}
	void writeCC4(uint16_t val) {_TIM1_(TIMX_CCR4) = val;}

	void CC1output(uint8_t bit) {BB_TIM1_CCER_CC1E = bit;}
	void CC2output(uint8_t bit) {BB_TIM1_CCER_CC2E = bit;}
	void CC3output(uint8_t bit) {BB_TIM1_CCER_CC3E = bit;}
	void CC4output(uint8_t bit) {BB_TIM1_CCER_CC4E = bit;}

	//BB (atomic) stuff
	//update event enable/disable (CR1->UDIS)
	void updateDisable() {BB_TIM1_CR1_UDIS = 0;}
	void updateEnable() {BB_TIM1_CR1_UDIS = 1;}

	//fast interrupt enable/disable (1 or 0)
	void updateInterrupt(uint8_t bit) {BB_TIM1_DIER_UIE = bit;}
	void CC1interrupt(uint8_t bit) {BB_TIM1_DIER_CC1IE = bit;}
	void CC2interrupt(uint8_t bit) {BB_TIM1_DIER_CC2IE = bit;}
	void CC3interrupt(uint8_t bit) {BB_TIM1_DIER_CC3IE = bit;}
	void CC4interrupt(uint8_t bit) {BB_TIM1_DIER_CC4IE = bit;}
	void COMinterrupt(uint8_t bit) {BB_TIM1_DIER_COMIE = bit;}
	void triggerInterrupt(uint8_t bit) {BB_TIM1_DIER_TIE = bit;}
	void breakInterrupt(uint8_t bit) {BB_TIM1_DIER_BIE = bit;}

	//check status flags
	uint8_t checkUpdate() {return (_TIM1_(TIMX_SR) & TIMX_SR_UIF);}
	uint8_t checkCC1() {return ((_TIM1_(TIMX_SR) & TIMX_SR_CC1IF)>>1);}
	uint8_t checkCC2() {return ((_TIM1_(TIMX_SR) & TIMX_SR_CC2IF)>>2);}
	uint8_t checkCC3() {return ((_TIM1_(TIMX_SR) & TIMX_SR_CC3IF)>>3);}
	uint8_t checkCC4() {return ((_TIM1_(TIMX_SR) & TIMX_SR_CC4IF)>>4);}
	uint8_t checkCOM() {return ((_TIM1_(TIMX_SR) & TIMX_SR_COMIF)>>5);}
	uint8_t checkTrigger() {return ((_TIM1_(TIMX_SR) & TIMX_SR_TIF)>>6);}
	uint8_t checkBreak() {return ((_TIM1_(TIMX_SR) & TIMX_SR_BIF)>>7);}


	//event generators
	void updateEvent() {BB_TIM1_EGR_UG = 1;}
	void CC1event() {BB_TIM1_EGR_CC1G = 1;}
	void CC2event() {BB_TIM1_EGR_CC2G = 1;}
	void CC3event() {BB_TIM1_EGR_CC3G = 1;}
	void CC4event() {BB_TIM1_EGR_CC4G = 1;}
	void COMevent() {BB_TIM1_EGR_COMG = 1;}
	void triggerEvent() {BB_TIM1_EGR_TG = 1;}
	void breakEvent() {BB_TIM1_EGR_BG = 1;}

	//interrupt flag cleaners, should use BB for these most certainly
	void clearUpdate() {BB_TIM1_SR_UIF = 0;}
	void clearCC1() {BB_TIM1_SR_CC1IF = 0;}
	void clearCC2() {BB_TIM1_SR_CC2IF = 0;}
	void clearCC3() {BB_TIM1_SR_CC3IF = 0;}
	void clearCC4() {BB_TIM1_SR_CC4IF = 0;}
	void clearCOM() {BB_TIM1_SR_COMIF = 0;}
	void clearTrigger() {BB_TIM1_SR_TIF = 0;}
	void clearBreak() {BB_TIM1_SR_BIF = 0;}
	void clearAll() {_TIM1_(TIMX_SR) = 0;}

	//IRQ priority
	void priority(uint8_t pri);
	void BRKpriority(uint8_t pri) {irq_priority(TIM1_BRK_IRQ, pri);}
	void UPpriority(uint8_t pri) {irq_priority(TIM1_UP_IRQ, pri);}
	void TRG_COMpriority(uint8_t pri) {irq_priority(TIM1_TRG_COM_IRQ, pri);}
	void CCpriority(uint8_t pri) {irq_priority(TIM1_CC_IRQ, pri);}

	//DMA stuff
	void DMACOMenable() {_TIM1_(TIMX_DIER) |= TIMX_DIER_COMDE;}
	void DMATRGenable() {_TIM1_(TIMX_DIER) |= TIMX_DIER_TDE;}
	void DMACCenable(uint8_t ch_num = 0);
	void DMAUPenable() {_TIM1_(TIMX_DIER) |= TIMX_DIER_UDE;}
	void DMACOMdisable()  {_TIM1_(TIMX_DIER) &= ~TIMX_DIER_COMDE;}
	void DMATRGdisable()  {_TIM1_(TIMX_DIER) &= ~TIMX_DIER_TDE;}
	void DMACCdisable(uint8_t ch_num = 0);
	void DMAUPdisable()  {_TIM1_(TIMX_DIER) &= ~TIMX_DIER_UDE;}
	void DMAburst(uint8_t burst) {_TIM1_(TIMX_DCR) &= ~TIMX_DCR_DBL; _TIM1_(TIMX_DCR) |= ((--burst) << 8);}
	void DMAbase(uint8_t base) {_TIM1_(TIMX_DCR) &= ~TIMX_DCR_DBA; _TIM1_(TIMX_DCR) |= base;}

